In [3]:
import pandas as pd

tabela = pd.read_excel("vendedores.xlsx")
display(tabela)

     Vendedor  Vendas          Loja  Imposto
0        Lira    3680           Rio      NaN
1       Julia    5301           Rio      NaN
2      Amanda    7378  Porto Alegre      NaN
3  Alessandra    6143            SP      NaN
4      Camila    4486           Rio      NaN
5      Marcus    6439            SP      NaN
6        Alon    5926           Rio      NaN
7   Candiotto    7176            SP      NaN
8       Pedro    1494            SP      NaN

### break

interrompe um loop e encerra ele

Ex: Se os vendedores baterem a meta de 30.000, todos ganham bônus

In [5]:
faturamento = 0
for venda in tabela['Vendas']:
    faturamento = faturamento + venda
    
    if faturamento > 30000:
        print("Batemos a meta")
        break

Batemos a meta

### continue

interrompe um loop e vai para a próxima iteração (próxima execução do loop)]

Ex: Imposto de 10% sobre todas as vendas<br>
Ex2: Porto Alegre aprovou isenção do imposto

In [8]:
for i, venda in enumerate(tabela['Vendas']):
    cidade = tabela.loc[i,'Loja']
    if cidade == 'Porto Alegre':
        continue
    imposto = 0.1
    valor_imposto = imposto * venda
    tabela.loc[i,"Imposto"] = valor_imposto

display(tabela)

     Vendedor  Vendas          Loja  Imposto
0        Lira    3680           Rio    368.0
1       Julia    5301           Rio    530.1
2      Amanda    7378  Porto Alegre      NaN
3  Alessandra    6143            SP    614.3
4      Camila    4486           Rio    448.6
5      Marcus    6439            SP    643.9
6        Alon    5926           Rio    592.6
7   Candiotto    7176            SP    717.6
8       Pedro    1494            SP    149.4